{
	"aboutmobile" : {
		"de" : "Über mich",
		"en" : "About me"
	},
	"about" : {
		"de" : "Über mich",
		"en" : "About me"
	},
	"lang" : {
		"de" : "<a href=\"/lang/en/\"> <img src=\"/united-states.svg\" alt=\"USA\" class=\"language\"></a>",
		"en" : "<a href=\"/lang/de/\"> <img src=\"/germany.svg\" alt=\"Germany\" class=\"language\"></a>"
 	},
	"p1" : {
		"de" : "Seit knapp 4 Jahren arbeite ich in der IT Branche, hauptsächlich im Bereich Backend Code und DevOps.",
		"en" : "For almost 4 years I have been working in the IT industry, mainly as a backend engineer doing some devops here and there."
	},
	"p2" : {
		"de" : "Um self taught dahin zu kommen, wo ich jetzt bin, musste ich zahllose Wochen nichts anderes tun außer Arbeiten, Lernen und Schlafen. Auch wenn dieser Weg schwer war, konnte ich über ihn mir eine außergewöhnliche Qualität aneignen.<br> Egal wie komplex eine Technologie auch sein mag, ich weiß immer das ich sie meistern kann, wenn es sein muss auch ganz auf mich alleine gestellt.",
		"en" : "Even though getting to where I am at entirely self taught, required countless weeks of just working, learning and sleeping, it also has become my biggest asset. I have a deep found confidence in my ability to learn difficult things fully, all by myself if need be."
	},
	"p3" :{
		"de" : "Ich bin ein aufgeschlossener Typ der sich für nichts zu Schade ist und ein aufrichtiges Interesse an den meisten seiner Mitmenschen hat.",
		"en" : "I am an open minded guy that is no stranger to having a good time. I love connecting with most people through being genuinely interested in them."
	},
	"last_update": {
		"de" : "Stand: 29 Okt. 2021",
		"en" : "Last updated: 20 Oct. 2021"
	},
	"languages" :{
		"de" : "Programmiersprachen:",
		"en" : "Programming languages:"
	},
	"tech_stack" : {
		"de" : "Mein Tech Stack",
		"en" : "My tech stack"
	},
	"go" : {
		"de" : "Hauptsächlich benutzt für komplexere Rest Dienste, die auch großer Last ausgesetzt sein können.",
		"en" : "Mainly used for more complex REST services, that also manage lots of traffic."
	},
	"spring" : {
		"de" : "Benutzt als interne Microservice API um die Library Vielfalt von Java ausnutzen zu können.",
		"en" : "Used for internal services that make use of the huge java eco system and all the available libraries."
	},
	"dotnet" : {
		"de" : "Benutzt für ein komplexes Backend einer fintech App in Kombination mit AWS Lambda.",
		"en" : "Used for a complex Backend of a fintech Software, thats based on AWS Lambda."
 	},
	"java" : {
		"de" : "Große Projekte im sog. MRP (Material Requirements Planning), like SAP.",
		"en" : "Big projects for MRP Systems (Material Requirements Planning), like SAP."
	},
	"cs" : {
		"de" : "Businesslogiken und Utilities in Produktionsbetrieben.",
		"en" : "Businesslogic and utilites to aid the manufacturing process."
	},
	"sql_id" : {
		"de" : "SQL (jede Art)",
		"en" : "SQL (every flavour)"
	},
	"sql_text" : {
		"de" : "Auswertungen von Betriebsdaten, große Berichte, die mehrschichtige SQL Abfragen als Basis verwenden.",
		"en" : "Reporting and analysis based on raw business data. Did several projects that use complex SQL queries as their basis."
	},
	"python" : {
		"de" : "Schweizer Taschenmesser, hauptsächlich für Skripts und Command-Line Utilities, die meinen eigenen Entwicklungsprozess unterstützen.",
		"en" : "Swiss army knife, mostly for small scripts and command line utilities, to aid my own development process."
	},
	"javafx" : {
		"de" : "Apps für Management in Industriebetrieben, die der Verwaltung und Kontrolle des Materialwertschöpfungsprozesses dienen.",
		"en" : "Apps for the management of manufacturing companies, that help visualize and control the value creation process."
	},
	"wpf" : {
		"de" : "Wie JavaFX nur von Windows. Bisher in Projekten verwendet, die außschließlich in Windows Umgebungen leben und entsprechende Abhängigkeiten haben.",
		"en" : "Like JavaFX just by Windows. This found applicance when there are hard dependencies on windows only libraries."
	},
	"nodejs" : {
		"de" : "Für lightweight Webserver/APIs, als Middleware zwischen Webendnutzer und aufwendigen Mircoservices.",
		"en" : "For HTTP APIs, in short as middleware between the end users browser and complex microservices."
	},
	"docker" : {
		"de" : "Containertechnologie bietet alle Vorteile von Virtualisierung, mit mehr direkter Kontrolle und ohne Performanceverluste.",
		"en" : "Container technology gives you all the advantages of virtualisation, and much more direct control, without loosing performance."
	},
	"kubernetes" : {
		"de" : "Verbindet mehrere Server zu einem Cluster, der speziell für Containertechnologie ausgelegt ist.",
		"en" : "Combine multiple servers to a single super computer centered around container technology."
	},
	"writing_id" : {
		"de" : "Schreiben/Formulieren",
		"en" : "Writing"
	},
	"writing_text" : {
		"de" : "Wenn man nur selbst mit seinen Systemen und Programmen arbeiten kann, sind diese wertlos. Sie müssen für Andere nachvollziehbar sein.",
		"en" : "If you are the only person that understands your code, it is worthless. Others need to be able to build upon your work."
	},
	"teaching_id" : {
		"de" : "Didaktik",
		"en" : "Teaching"
	},
	"teaching_text" : {
		"de" : "Wissen kann unbegrenzt kopiert werden. Sein Wissen Anderen vermitteln zu können ist einer der leichtesten Wege den eigenen Wert zu erhöhen.",
		"en" : "Knowledge can be copied infinetly without any diminishing returns. Being good at transferring knowledge is one of the easiest ways to increase ones value."
	},
	"blog_id" : {
		"de" : "Blogeinträge",
		"en" : "Blog entries"
	},
	"blog_words" : {
		"de" : "Geschriebene Wörter",
		"en" : "Written words"
	},
	"blog_text" : {
		"de" : "Besagter Blog über besagte Themen.",
		"en" : "My tech blog."
	},
	"wiki_words" : {
		"de" : "Geschriebene Wörter",
		"en" : "Written words"
	},
	"wiki_id" : {
		"de" : "Wiki Einträge",
		"en" : "Wiki entries"
	},
	"wiki_text" : {
		"de" : "Meine eigene kleine Knowledgebase",
		"en" : "My own little knowledgebase"
	},
	"gitea_text" : {
		"de" : "Praktisch wie GitHub nur self-hosted.",
		"en" : "Like Github but self-hosted."
	}

}